matsvandamme/msp430g2553/drivers/led.c
#include "led.h" // Now includes the header with the opaque handle
#include <msp430.h>
#include <stddef.h>
#include "../common/defines.h" // Assuming ARRAY_SIZE and GPIO definitions are here

// --- Private Module Constants ---
#define SMCLK_FREQ_HZ       16000000UL
#define TIMER_CLK_DIVIDER   8
#define TIMER_FREQ_HZ       (SMCLK_FREQ_HZ / TIMER_CLK_DIVIDER) // 2 MHz
#define TIMER_PERIOD_MS     1
#define TIMER_COUNTS_PER_MS (TIMER_FREQ_HZ / 1000) // 2000 counts

// --- Private Structure Definition ---

/**
 * @brief The internal, private definition of the LED control structure.
 * @note This structure is hidden from any file that only includes led.h.
 * The name 'led_s' matches the forward declaration in the header.
 */
struct led_s
{
    const gpio_e io;        ///< GPIO pin associated with the LED (read-only).
    led_state_e state;      ///< Current physical state of the LED (ON or OFF).
    uint16_t on_period_ms;  ///< Duration (ms) the LED stays ON during blinking.
    uint16_t off_period_ms; ///< Duration (ms) the LED stays OFF during blinking.
    bool is_blinking;       ///< Flag indicating if the LED is currently blinking.
    uint32_t last_toggle_time; ///< System time (ms) when the LED state was last changed.
};

// --- Private Module Variables ---

/**
 * @brief Millisecond system tick counter, incremented by the Timer A0 ISR.
 * @warning This variable is modified by an ISR. Access from the main context
 * must be atomic (i.e., performed with interrupts disabled).
 */
static volatile uint32_t system_tick_ms = 0;

/**
 * @brief Array of LED control structures. Declared 'static' to encapsulate it
 * within this module, preventing direct external access.
 */
static volatile struct led_s leds[] = {
    {
        .io = IO_LED_GREEN,
        .state = LED_OFF,
        .on_period_ms = LED_ON_PERIOD_MS_DEFAULT,
        .off_period_ms = LED_OFF_PERIOD_MS_DEFAULT,
        .is_blinking = false,
        .last_toggle_time = 0,
    },
    {
        .io = IO_LED_RED,
        .state = LED_OFF,
        .on_period_ms = LED_ON_PERIOD_MS_DEFAULT,
        .off_period_ms = LED_OFF_PERIOD_MS_DEFAULT,
        .is_blinking = false,
        .last_toggle_time = 0,
    }
};

// --- Public Function Definitions ---

void led_init(void)
{
    // Configure GPIO pins for all LEDs as outputs, initially turned off for power saving
    gpio_config_t cfg = {
        .dir = IO_DIR_OUTPUT,
        .out = IO_OUT_LOW,
        .resistor = IO_RESISTOR_DISABLED,
        .select = IO_SELECT_GPIO,
    };

    for (uint8_t i = 0; i < ARRAY_SIZE(leds); i++) {
        gpio_configure(leds[i].io, &cfg);
    }

    /*
     * Configure Timer A0 to generate a 1ms interrupt for the system tick.
     * ... (timer configuration comments remain the same) ...
     */
    TA0CTL = TASSEL_2 | ID_3 | MC_1 | TACLR;
    TA0CCR0 = (TIMER_COUNTS_PER_MS * TIMER_PERIOD_MS) - 1;
    TA0CCTL0 |= CCIE; // Enable the Capture/Compare Register 0 interrupt
}

led_handle_t led_get_handle(gpio_e io)
{
    for (uint8_t i = 0; i < ARRAY_SIZE(leds); i++) {
        if (leds[i].io == io) {
            // Return a pointer to the internal struct. This is the opaque handle.
            return (led_handle_t)&leds[i];
        }
    }
    return NULL; // Return NULL if no matching LED is found
}

// NOTE: The function parameter is now 'handle' for clarity.
void led_set_state(led_handle_t handle, led_state_e state)
{
    if (handle == NULL) return;

    // The 'volatile' is cast away implicitly by the assignment.
    // This is safe within this controlled API.
    struct led_s* led = handle;

    if (state == LED_ON) {
        gpio_set_out(led->io, IO_OUT_HIGH);
        led->state = LED_ON;
    } else {
        gpio_set_out(led->io, IO_OUT_LOW);
        led->state = LED_OFF;
    }
}

void led_start_blinking(led_handle_t handle, uint16_t on_period_ms, uint16_t off_period_ms)
{
    if (handle == NULL) return;

    // We can directly access members because this file has the full struct definition.
    struct led_s* led = handle;

    led->on_period_ms = on_period_ms;
    led->off_period_ms = off_period_ms;
    
    // --- Critical Section: Atomically read the system tick ---
    __disable_interrupt();
    led->last_toggle_time = system_tick_ms;
    __enable_interrupt();
    // --- End Critical Section ---

    led->is_blinking = true;
    led_set_state(led, LED_ON); // Start the blinking sequence with the LED ON
    led->is_blinking = true;    // Restore flag, as led_set_state might clear it.
}

void led_stop_blinking(led_handle_t handle)
{
    if (handle == NULL) return;
    
    struct led_s* led = handle;

    led->is_blinking = false;
    led_set_state(led, LED_OFF); // Ensure LED is off when blinking stops
}

void led_handle_blinking(void)
{
    uint32_t current_time;

    // --- Critical Section: Atomically read the shared system tick variable ---
    __disable_interrupt();
    current_time = system_tick_ms;
    __enable_interrupt();
    // --- End Critical Section ---

    for (uint8_t i = 0; i < ARRAY_SIZE(leds); i++) {
        // Use a non-volatile pointer for manipulation within this function
        struct led_s *led = (struct led_s*)&leds[i];

        if (led->is_blinking) {
            // Unsigned subtraction correctly handles timer rollover
            uint32_t elapsed_time = current_time - led->last_toggle_time;
            
            uint16_t current_period = (led->state == LED_ON) ? led->on_period_ms : led->off_period_ms;

            if (elapsed_time >= current_period) {
                // Toggle state
                led_state_e new_state = (led->state == LED_ON) ? LED_OFF : LED_ON;
                led_set_state(led, new_state);
                led->is_blinking = true; // led_set_state clears this, so restore it.
                led->last_toggle_time = current_time;
            }
        }
    }
}

// --- Interrupt Service Routine ---
__attribute__((interrupt(TIMER0_A0_VECTOR)))
void Timer0_A0_ISR(void)
{
    system_tick_ms++;
}
